const { MessageEmbed , MessageActionRow , MessageButton , MessageSelectMenu} = require('discord.js')

const Scriman = {
    name:"scrim-rules",
    description:"To Send Scrim Rules ",


    run: async (client, Interaction, args) => {
if (!Interaction.member.permissions.has("MANAGE_ROLES")) return;


const hefny = new MessageEmbed()
      .setColor("BLACK")
          .setAuthor(`${Interaction.user.username}`, Interaction.user.displayAvatarURL({ dynamic: true }))
      .setTitle(' __**Scrim Rules**__ ')
    
        .setDescription(`** ENGLISH 

> <a:977003084054151198:1226882217544781885> 1- 𝗙𝗶𝗻𝘀𝗵𝗶𝗻𝗴 𝗪𝗵𝗶𝘁𝗵 𝗣𝗮𝗻 𝗜𝘀 𝗙𝗼𝗿𝗕𝗶𝗱𝗱𝗲𝗻
  
> <a:977003084054151198:1226882217544781885> 2- 𝗙𝗶𝗻𝗶𝘀𝗵𝗶𝗻𝗴 𝗪𝗵𝗶𝘁𝗵 𝗣𝗮𝗻 𝗜𝘀 𝗔𝗹𝗹𝗼𝘄𝗲𝗱 𝗜𝗳 𝗧𝗵𝗲𝗿𝗲 𝗜𝘀 𝗡𝗼 𝗪𝗲𝗮𝗽𝗼𝗻 𝗢𝗿 𝗔𝗺𝗺𝗼

> <a:977003084054151198:1226882217544781885> 3- 𝗡𝗼 𝗨𝘀𝗶𝗻𝗴 𝗚𝗹𝗶𝘁𝗰𝗵 𝗢𝗿 𝗛𝗮𝗰𝗸 𝗜𝘀 𝗙𝗼𝗿𝗯𝗶𝗱𝗱𝗲𝗻

> <a:977003084054151198:1226882217544781885> 4- 𝗬𝗼𝘂 𝗠𝘂𝘀𝘁 𝗦𝘁𝗶𝗰𝗸 𝗧𝗼 𝗧𝗵𝗲 𝗧𝗶𝗺𝗲 𝗔𝗻𝗱 𝗟𝗼𝘅𝗮𝘁𝗶𝗼𝗻 𝗢𝗳 𝗧𝗵𝗲 𝗧𝗲𝗮𝗺

> <a:977003084054151198:1226882217544781885> 5- 𝗜𝘁'𝘀 𝗙𝗼𝗿𝗯𝗶𝗱𝗱𝗲 𝗧𝗼 𝗢𝗽𝗲𝗻 𝗔𝗹𝗹 𝗖𝗵𝗮𝘁 𝗠𝗶𝗰

> <a:977003084054151198:1226882217544781885> 6- 𝗔𝗰𝗼𝘂𝗻𝘁 𝗟𝗲𝘃𝗲𝗹 𝗠𝘂𝘀𝘁 𝗕𝗲 45 𝗟𝘃𝗹 𝗢𝗿 𝗕𝗼𝘃𝗲

> <a:977003084054151198:1226882217544781885> 7- 𝗔 𝗣𝗹𝗮𝘆𝗲𝗿 𝗙𝗿𝗼𝗺 𝗘𝘃𝗲𝗿𝘆 𝗧𝗲𝗮𝗺 𝗠𝘂𝘀𝘁 𝗥𝗲𝗰𝗼𝗿𝗱 𝗧𝗵𝗲 𝗚𝗲𝗮𝗺 𝗜𝗳 𝗜𝗻 𝗗𝗼𝘂𝗯𝘁 𝗣𝗟𝗲𝗮𝘀𝗲 𝗖𝗼𝗻𝘁𝗮𝗰𝘁 𝗧𝗵𝗲 𝗢𝗿𝗴𝗮𝗻𝗶𝘇𝗮𝗿

> <a:977003084054151198:1226882217544781885> 8- 𝗡𝗼 𝗔𝗹𝗹𝗼𝘄𝗲𝗱 𝗧𝗼 𝗨𝘀𝗲 𝗙𝗹𝗮𝗿𝗲𝗴𝘂𝗻

 العربية

> <a:977003084054151198:1226882217544781885> 1- ممنوع التفنيش بالطاوة

> <a:977003084054151198:1226882217544781885> 2- في حاله عدم وجود طلق او سلاح مسموح مع اخد اسكرين تثبت عدم وجود سلاح او طلق

> <a:977003084054151198:1226882217544781885> 3- غير مسموح استخدام الجيلتشات او الهاك

> <a:977003084054151198:1226882217544781885> 4- الالتزام بالوقت وخانـة الفريق والالتزام بالتسجيل

> <a:977003084054151198:1226882217544781885> 5- ممنوع فتح المايك العام منعًا باتــًا بعد النزول من الطائـرة

> <a:977003084054151198:1226882217544781885> 6- ممنوع دخول حساب اقل من لفل 45

> <a:977003084054151198:1226882217544781885> 7- يجب على لاعب من كل تيم تصوير الجيم اذا كان في شك المرجو التواصل مع المنظمين

> <a:977003084054151198:1226882217544781885> 8- غير مسموح استخدام الفلير**`)
       

Interaction.reply({embeds: [hefny]})
}
};  

module.exports = Scriman;